apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_pwm.c
/****************************************************************************
 * arch/arm/src/s32k1xx/s32k1xx_pwm.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/timers/pwm.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"

#include "s32k1xx_clockconfig.h"
#include "s32k1xx_pin.h"
#include "s32k1xx_pwm.h"
#include "hardware/s32k1xx_gpio.h"
#include "hardware/s32k1xx_ftm.h"
#include "hardware/s32k1xx_sim.h"

/* This module then only compiles if there is at least one enabled timer
 * intended for use with the PWM upper half driver.
 */

#if defined(CONFIG_S32K1XX_FTM0_PWM) || defined(CONFIG_S32K1XX_FTM1_PWM) || \
    defined(CONFIG_S32K1XX_FTM2_PWM) || defined(CONFIG_S32K1XX_FTM3_PWM) || \
    defined(CONFIG_S32K1XX_FTM4_PWM) || defined(CONFIG_S32K1XX_FTM5_PWM) || \
    defined(CONFIG_S32K1XX_FTM6_PWM) || defined(CONFIG_S32K1XX_FTM7_PWM)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PWM/Timer Definitions ****************************************************/

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
#  define pwm_dumpgpio(p,m) s32k1xx_pindump(p,m)
#else
#  define pwm_dumpgpio(p,m)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure represents the state of one PWM timer */

struct s32k1xx_pwmtimer_s
{
  const struct pwm_ops_s *ops;     /* PWM operations */
  uint8_t                 tpmid;   /* Timer/PWM Module ID {0,..,7} */
  uint8_t                 channel; /* Timer/PWM Module channel: {0,...,7} */
  uint32_t                base;    /* The base address of the timer */
  uint32_t                pincfg;  /* Output pin configuration */
  uint32_t                pclk;    /* The frequency of the peripheral clock */
};

/****************************************************************************
 * Static Function Prototypes
 ****************************************************************************/

/* Register access */

static uint32_t pwm_getreg(struct s32k1xx_pwmtimer_s *priv, int offset);
static void pwm_putreg(struct s32k1xx_pwmtimer_s *priv, int offset,
                       uint32_t value);

#ifdef CONFIG_DEBUG_PWM_INFO
static void pwm_dumpregs(struct s32k1xx_pwmtimer_s *priv,
                         const char *msg);
#else
#  define pwm_dumpregs(priv,msg)
#endif

/* Timer management */

static int pwm_timer(struct s32k1xx_pwmtimer_s *priv,
                     const struct pwm_info_s *info);

/* PWM driver methods */

static int pwm_setup(struct pwm_lowerhalf_s *dev);
static int pwm_shutdown(struct pwm_lowerhalf_s *dev);

static int pwm_start(struct pwm_lowerhalf_s *dev,
                     const struct pwm_info_s *info);

static int pwm_stop(struct pwm_lowerhalf_s *dev);
static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                     unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This is the list of lower half PWM driver methods used by the upper half
 * driver.
 */

static const struct pwm_ops_s g_pwmops =
{
  .setup    = pwm_setup,
  .shutdown = pwm_shutdown,
  .start    = pwm_start,
  .stop     = pwm_stop,
  .ioctl    = pwm_ioctl,
};

#ifdef CONFIG_S32K1XX_FTM0_PWM
static struct s32k1xx_pwmtimer_s g_pwm0dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 0,
  .channel    = CONFIG_S32K1XX_FTM0_CHANNEL,
  .base       = S32K1XX_FTM0_BASE,
  .pincfg     = PWM_FTM0_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM1_PWM
static struct s32k1xx_pwmtimer_s g_pwm1dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 1,
  .channel    = CONFIG_S32K1XX_FTM1_CHANNEL,
  .base       = S32K1XX_FTM1_BASE,
  .pincfg     = PWM_FTM1_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM2_PWM
static struct s32k1xx_pwmtimer_s g_pwm2dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 2,
  .channel    = CONFIG_S32K1XX_FTM2_CHANNEL,
  .base       = S32K1XX_FTM2_BASE,
  .pincfg     = PWM_FTM2_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM3_PWM
static struct s32k1xx_pwmtimer_s g_pwm3dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 3,
  .channel    = CONFIG_S32K1XX_FTM3_CHANNEL,
  .base       = S32K1XX_FTM3_BASE,
  .pincfg     = PWM_FTM3_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM4_PWM
static struct s32k1xx_pwmtimer_s g_pwm4dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 4,
  .channel    = CONFIG_S32K1XX_FTM4_CHANNEL,
  .base       = S32K1XX_FTM4_BASE,
  .pincfg     = PWM_FTM4_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM5_PWM
static struct s32k1xx_pwmtimer_s g_pwm5dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 5,
  .channel    = CONFIG_S32K1XX_FTM5_CHANNEL,
  .base       = S32K1XX_FTM5_BASE,
  .pincfg     = PWM_FTM5_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM6_PWM
static struct s32k1xx_pwmtimer_s g_pwm6dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 6,
  .channel    = CONFIG_S32K1XX_FTM6_CHANNEL,
  .base       = S32K1XX_FTM6_BASE,
  .pincfg     = PWM_FTM6_PINCFG,
};
#endif

#ifdef CONFIG_S32K1XX_FTM7_PWM
static struct s32k1xx_pwmtimer_s g_pwm7dev =
{
  .ops        = &g_pwmops,
  .tpmid      = 7,
  .channel    = CONFIG_S32K1XX_FTM7_CHANNEL,
  .base       = S32K1XX_FTM7_BASE,
  .pincfg     = PWM_FTM7_PINCFG,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pwm_getreg
 *
 * Description:
 *   Read the value of an PWM timer register.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t pwm_getreg(struct s32k1xx_pwmtimer_s *priv, int offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: pwm_putreg
 *
 * Description:
 *   Read the value of an PWM timer register.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void pwm_putreg(struct s32k1xx_pwmtimer_s *priv, int offset,
                       uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: pwm_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input Parameters:
 *   priv - A reference to the PWM block status
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_PWM_INFO
static void pwm_dumpregs(struct s32k1xx_pwmtimer_s *priv,
                         const char *msg)
{
  pwminfo("%s:\n", msg);
  pwminfo("  FTM%d_SC:     %04x   FTM%d_CNT:  %04x     FTM%d_MOD:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_CNT_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_MOD_OFFSET));
  pwminfo("  FTM%d_STATUS: %04x   FTM%d_CONF: %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_STATUS_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_CONF_OFFSET));
  pwminfo("   FTM%d_C0SC:  %04x   FTM%d_C0V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C0SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C0V_OFFSET));
  pwminfo("   FTM%d_C1SC:  %04x   FTM%d_C1V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C1SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C1V_OFFSET));
  pwminfo("   FTM%d_C2SC:  %04x   FTM%d_C2V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C2SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C2V_OFFSET));
  pwminfo("   FTM%d_C3SC:  %04x   FTM%d_C3V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C3SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C3V_OFFSET));
  pwminfo("   FTM%d_C4SC:  %04x   FTM%d_C4V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C4SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C4V_OFFSET));
  pwminfo("   FTM%d_C5SC:  %04x   FTM%d_C5V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C5SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C5V_OFFSET));
  pwminfo("   FTM%d_C6SC:  %04x   FTM%d_C6V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C6SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C6V_OFFSET));
  pwminfo("   FTM%d_C7SC:  %04x   FTM%d_C7V:  %04x\n",
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C7SC_OFFSET),
          priv->tpmid, pwm_getreg(priv, S32K1XX_FTM_C7V_OFFSET));
}
#endif

/****************************************************************************
 * Name: pwm_timer
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input Parameters:
 *   priv - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_timer(struct s32k1xx_pwmtimer_s *priv,
                     const struct pwm_info_s *info)
{
  /* Calculated values */

  uint32_t prescaler;
  uint32_t tpmclk;
  uint32_t modulo;
  uint32_t regval;
  uint32_t cv;
  uint8_t i;

  static const uint8_t presc_values[8] =
  {
    1, 2, 4, 8, 16, 32, 64, 128
  };

  /* Register contents */

  DEBUGASSERT(priv != NULL && info != NULL);

  pwminfo("FTM%d channel: %d frequency: %" PRId32 " duty: %08" PRIx32 "\n",
          priv->tpmid, priv->channel, info->frequency,
          info->channels[0].duty);

  DEBUGASSERT(info->frequency > 0 && info->channels[0].duty > 0 &&
              info->channels[0].duty < uitoub16(100));

  /* Calculate optimal values for the timer prescaler and for the timer
   * modulo register.  If' frequency' is the desired frequency, then
   *
   *   modulo = tpmclk / frequency
   *   tpmclk = pclk / presc
   *
   * Or,
   *
   *   modulo = pclk / presc / frequency
   *
   * There are many solutions to do this, but the best solution will be the
   * one that has the largest modulo value and the smallest prescaler value.
   * That is the solution that should give us the most accuracy in the timer
   * control.  Subject to:
   *
   *   1 <= presc  <= 128 (need to be 1, 2, 4, 8, 16, 32, 64, 128)
   *   1 <= modulo <= 65535
   *
   * So presc = pclk / 65535 / frequency would be optimal.
   *
   * Example:
   *
   *  pclk      = 24 MHz
   *  frequency = 100 Hz
   *
   *  prescaler = 24,000,000 / 65,535 / 100
   *            = 3.6 (or 4 -- taking the ceiling always)
   *  timclk    = 24,000,000 / 4
   *            = 6,000,000
   *  modulo    = 6,000,000 / 100
   *            = 60,000
   */

  prescaler = (priv->pclk / info->frequency + 65534) / 65535;

  for (i = 0; i < 7; i++)
    {
      if (prescaler <= presc_values[i])
        {
           break;
        }
    }

  prescaler = i;

  tpmclk = priv->pclk / presc_values[prescaler];

  modulo = tpmclk / info->frequency;
  if (modulo < 1)
    {
      modulo = 1;
    }
  else if (modulo > 65535)
    {
      modulo = 65535;
    }

  /* Duty cycle:
   *
   * duty cycle = cv / modulo (fractional value)
   */

  cv = b16toi(info->channels[0].duty * modulo + b16HALF);

  pwminfo("FTM%d PCLK: %" PRId32 " frequency: %" PRId32 " FTMCLK: %" PRId32
          " prescaler: %d modulo: %" PRId32 "c0v: %" PRId32 "\n",
          priv->tpmid, priv->pclk, info->frequency, tpmclk,
          presc_values[prescaler], modulo, cv);

