apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_pwm.c
  /* Disable further interrupts and stop the timer */

  pwm_putreg(priv, S32K1XX_FTM_SC_OFFSET, FTM_SC_CLKS_DIS);
  pwm_putreg(priv, S32K1XX_FTM_CNT_OFFSET, 0);

  /* Determine which timer channel to clear */

  switch (priv->channel)
    {
      case 0:
        pwm_putreg(priv, S32K1XX_FTM_C0V_OFFSET, 0);
        break;

      case 1:
        pwm_putreg(priv, S32K1XX_FTM_C1V_OFFSET, 0);
        break;

      case 2:
        pwm_putreg(priv, S32K1XX_FTM_C2V_OFFSET, 0);
        break;

      case 3:
        pwm_putreg(priv, S32K1XX_FTM_C3V_OFFSET, 0);
        break;

      case 4:
        pwm_putreg(priv, S32K1XX_FTM_C4V_OFFSET, 0);
        break;

      case 5:
        pwm_putreg(priv, S32K1XX_FTM_C5V_OFFSET, 0);
        break;

      case 6:
        pwm_putreg(priv, S32K1XX_FTM_C6V_OFFSET, 0);
        break;

      case 7:
        pwm_putreg(priv, S32K1XX_FTM_C7V_OFFSET, 0);
        break;

      default:
        pwmerr("ERROR: No such channel: %d\n", priv->channel);
        leave_critical_section(flags);
        return -EINVAL;
    }

  leave_critical_section(flags);

  pwm_dumpregs(priv, "After stop");
  return OK;
}

/****************************************************************************
 * Name: pwm_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   cmd - The ioctl command
 *   arg - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                     unsigned long arg)
{
#ifdef CONFIG_DEBUG_PWM_INFO
  struct s32k1xx_pwmtimer_s *priv = (struct s32k1xx_pwmtimer_s *)dev;

  /* There are no platform-specific ioctl commands */

  pwminfo("FTM%d\n", priv->tpmid);
#endif
  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_pwminitialize
 *
 * Description:
 *   Initialize one timer for use with the upper_level PWM driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use.
 *
 * Returned Value:
 *   On success, a pointer to the S32K1XX lower half PWM driver is returned.
 *   NULL is returned on any failure.
 *
 ****************************************************************************/

struct pwm_lowerhalf_s *s32k1xx_pwminitialize(int timer)
{
  struct s32k1xx_pwmtimer_s *lower;
  int ret;
  uint32_t sysclk;

  sysclk = s32k1xx_get_coreclk();
  ret = (sysclk == 0) ? -ENODEV : OK;

  pwminfo("FTM%d\n", timer);

  switch (timer)
    {
#ifdef CONFIG_S32K1XX_FTM0_PWM
      case 0:
        g_pwm0dev.pclk = sysclk;
        lower = &g_pwm0dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM1_PWM
      case 1:
        g_pwm1dev.pclk = sysclk;
        lower = &g_pwm1dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM2_PWM
      case 2:
        g_pwm2dev.pclk = sysclk;
        lower = &g_pwm2dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM3_PWM
      case 3:
        g_pwm3dev.pclk = sysclk;
        lower = &g_pwm3dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM4_PWM
      case 4:
        g_pwm4dev.pclk = sysclk;
        lower = &g_pwm4dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM5_PWM
      case 5:
        g_pwm5dev.pclk = sysclk;
        lower = &g_pwm5dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM6_PWM
      case 6:
        g_pwm6dev.pclk = sysclk;
        lower = &g_pwm6dev;
        break;
#endif
#ifdef CONFIG_S32K1XX_FTM7_PWM
      case 7:
        g_pwm7dev.pclk = sysclk;
        lower = &g_pwm7dev;
        break;
#endif
      default:
        pwmerr("ERROR: No such timer configured\n");
        return NULL;
    }

    if (ret != OK)
      {
        pwmerr("ERROR: FTM%d peripheral clock not available\n", timer);
        return NULL;
      }

  return (struct pwm_lowerhalf_s *)lower;
}

#endif /* CONFIG_S32K1XX_FTMn_PWM, n = 0,...,7 */
